"""
написати програму для виведення цілих чисел прописом
"""
units_1_9 = ["нуль","один","два","три","чотири","п'ять","шість","сім","вісім","дев'ять"]
units_10_19 = ["десять","одинадцять","дванадцять","тринадцять","чотирнадцять",\
        "п'ятнадцять","шістнадцять","сімнадцять","вісімнадцять","дев'ятнадцять"]
tens = ["двадцять","тридцять","сорок","п'ятдесят","шістдесят","сімдесят","вісімдесят","дев'яносто"]
hundreds = ["сто","двісті","триста","чотириста","п'ятсот","шістсот","сімсот","вісімсот","дев'ятсот"]
#print(units_1_9, units_10_19, tens, hundreds)
numbers = int(input("введіть ціле число від 0 до 1000 : "))
if numbers < 10:
    print(units_1_9[numbers])
elif 9 < numbers < 20:
    print(units_10_19[numbers - 10])
elif 19 < numbers < 99:
    print(tens[numbers//10-2])
elif 99 < numbers < 1000:
    print(hundreds[(numbers//100)-1])
